In [1]:
import pandas as pd

In [2]:
import pandas as pd
dict1 ={ 'Name': ['Priyank','Aadhya','krisha','vedant','parshav','mittal','archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['male','female','female','male','male','male','female']}
df1=pd.DataFrame(dict1)
print(df1)

      Name  Marks  Gender
0  Priyank     98    male
1   Aadhya     89  female
2   krisha     99  female
3   vedant     87    male
4  parshav     90    male
5   mittal     83    male
6  archana     99  female

In [3]:
#display first 5 Row

print("Display first 5 rows")
print(df1.head())

Display first 5 rows
      Name  Marks  Gender
0  Priyank     98    male
1   Aadhya     89  female
2   krisha     99  female
3   vedant     87    male
4  parshav     90    male

In [4]:
#display info
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [5]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [6]:
print('names of columns', df1.shape[1])

names of columns 3

In [7]:
df1.shape

(7, 3)

In [8]:
#display names of columns:
print("names of columns:", df1.columns.tolist())

names of columns: ['Name', 'Marks', 'Gender']

In [9]:
#check null values in the dataset
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df1.describe(include='all')

           Name      Marks Gender
count         7   7.000000      7
unique        7        NaN      2
top     Priyank        NaN   male
freq          1        NaN      4
mean        NaN  92.142857    NaN
std         NaN   6.491753    NaN
min         NaN  83.000000    NaN
25%         NaN  88.000000    NaN
50%         NaN  90.000000    NaN
75%         NaN  98.500000    NaN
max         NaN  99.000000    NaN

In [11]:
#unique value for a column
df1['Gender'].unique()

array(['male', 'female'], dtype=object)

In [12]:
#find the number of unique column
df1['Gender'].nunique()

2

In [13]:
#display count of unique values in column
df1['Gender'].value_counts()

Gender
male      4
female    3
Name: count, dtype: int64

In [25]:
#total number of students having marks in between 90 to 100 (inclusive) using between method
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyank     98    male
2   krisha     99  female
4  parshav     90    male
6  archana     99  female

In [29]:
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyank     98    male
2   krisha     99  female
4  parshav     90    male
6  archana     99  female

In [37]:
#find average
df1['Marks'].mean()

np.float64(92.14285714285714)

In [44]:
#apply() method
def marks(x):
    return x/2

In [45]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [46]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [47]:
print(df1)

      Name  Marks  Gender  Half_marks
0  Priyank     98    male        49.0
1   Aadhya     89  female        44.5
2   krisha     99  female        49.5
3   vedant     87    male        43.5
4  parshav     90    male        45.0
5   mittal     83    male        41.5
6  archana     99  female        49.5

In [14]:
df1['all_mean']=df1['Marks'].mean()
print(df1)

      Name  Marks  Gender   all_mean
0  Priyank     98    male  92.142857
1   Aadhya     89  female  92.142857
2   krisha     99  female  92.142857
3   vedant     87    male  92.142857
4  parshav     90    male  92.142857
5   mittal     83    male  92.142857
6  archana     99  female  92.142857

In [17]:
#how to drop a column
df1.drop('all_mean',axis=1)

      Name  Marks  Gender
0  Priyank     98    male
1   Aadhya     89  female
2   krisha     99  female
3   vedant     87    male
4  parshav     90    male
5   mittal     83    male
6  archana     99  female

In [20]:
#lambda function
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [21]:
#print name of columns
df1.columns

Index(['Name', 'Marks', 'Gender', 'all_mean'], dtype='object')

In [24]:
#give the name of only females
df1[df1['Gender'].isin(['female'])]

      Name  Marks  Gender   all_mean
1   Aadhya     89  female  92.142857
2   krisha     99  female  92.142857
6  archana     99  female  92.142857

In [25]:
#sort by marks
df1.sort_values(by='Marks')

      Name  Marks  Gender   all_mean
5   mittal     83    male  92.142857
3   vedant     87    male  92.142857
1   Aadhya     89  female  92.142857
4  parshav     90    male  92.142857
0  Priyank     98    male  92.142857
2   krisha     99  female  92.142857
6  archana     99  female  92.142857